export const link: Record<string, string>[] = [
    {
        '/MokembaMascot/html/link/1.png': 'Ты сам знаешь что такое ссылка (я надеюсь)'
    },
    {
        '/MokembaMascot/html/link/1.png': 'Так что сейчас я покажу как создать ссылку в HTML'
    },
    {
        '/MokembaMascot/html/link/2.png': 'Для этой задачи есть тег <a>'
    },
    {
        '/MokembaMascot/html/link/3.png': 'Этот тег принимает "АТРИБУТ", Атрибуты настраивают поведение тега: внешний вид, действия...'
    },
    {
        '/MokembaMascot/html/link/4.png': 'Первый параметр - это "href". Атрибут "href" хранит ссылку в которую вас переместит тег <a>'
    },
    {
        '/MokembaMascot/html/link/5.png': 'Ты можещь хранить ссылку на номер телефона, на файл, на другие теги html, телеграм каналы...'
    },
    {
        '/MokembaMascot/html/link/6.png': 'Но не смей забивать себе этим голову, просто знай об этом. Сейчас тебе этого не нужно зубрить, просто знай что <a> не ограничен одними ссылками'
    },
    {
        '/MokembaMascot/html/link/7.png': 'Теперь повтори за моим кодом. Добавь ссылку: "https://www.duolingo.com" в атрибут href тега <a>'
    },
    {
        '/MokembaMascot/html/link/1.png': 'Хм'
    },
    {
        '/MokembaMascot/html/link/1.png': 'Я не знаю что ты там написал, но если ты кликаешь по ссылке на странице и тебя перемещают, то все нормально'
    },
    {
        '/MokembaMascot/html/link/1.png': 'А если не получается, не переживай. Твой мозг рано или поздно запомнит синтаксис HTML и потом тебе будет проще'
    },
    {
        '/MokembaMascot/html/link/1.png': 'Теперь я покажу второй но не менее важный атрибут тега <a>'
    },
    {
        '/MokembaMascot/html/link/1.png': 'Атрибут "target". Этот атрибут определяет где именно будет открываться ссылка'
    },
    {
        '/MokembaMascot/html/link/8.png': 'Но тебе достаточно просто знать значение "_blank". Вот так это выглядит: target="_blank". Атрибут: "target" со значением: "_blank" тупо откроет ссылку в другой вкладке'
    },
    {
        '/MokembaMascot/html/link/1.png': 'Не торопись и просто освой этот тег. После успешного усвоения навыка я буду ждать тебя в следующем разделе'
    }
]