export const undefinedd: Record<string, string>[] = [
    {
        '/MokembaMascot/js/1.png': 'Запомни вебмакака, undefined это ничто, это пустота, это вакум, это нечто что существовало в js еще до твоего прибытия, это даже не 0, это абсолютное ничто',
    },
    {
        '/MokembaMascot/js/3.png': 'А с Null кстати другая история. Null это пустой объект, а может это не объект, а просто примитив, я не знаю. По мнению typeof - null это object'
    },
    {
        '/MokembaMascot/js/undefined/1.png': 'Не смотря на то, что console.log(typeof null) говорит что Null это object, у этого "объекта" нету свойств или методов.'
    },
    {
        '/MokembaMascot/js/3.png': 'Так что воспринимай тип примитива Null как просто баг который не будут фиксить (потому что это уничтожит обратную совместимость, и все старые сайты умрут иза фикса)'
    },
]